<?php
/**
 * 插件设置页面
 *
 * @package    WBOLT
 * @author     WBOLT
 * @since      1.1.0
 * @license    GPL-2.0+
 * @copyright  Copyright (c) 2019, WBOLT
 */

$pd_title = 'Kill 429设置';
$pd_version = WP_KILL_429_VERSION;
$pd_code = 'kill-429-setting';
$pd_index_url = 'https://www.wbolt.com/plugins/kill-429';
$pd_doc_url = 'https://www.wbolt.com/kill-429-plugin-documentation.html';

?>

<div style=" display:none;">
    <svg aria-hidden="true" style="position: absolute; width: 0; height: 0; overflow: hidden;" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
        <defs>
            <symbol id="sico-upload" viewBox="0 0 16 13">
                <path d="M9 8v3H7V8H4l4-4 4 4H9zm4-2.9V5a5 5 0 0 0-5-5 4.9 4.9 0 0 0-4.9 4.3A4.4 4.4 0 0 0 0 8.5C0 11 2 13 4.5 13H12a4 4 0 0 0 1-7.9z" fill="#666" fill-rule="evenodd"/>
            </symbol>
            <symbol id="sico-wb-logo" viewBox="0 0 18 18">
                <title>sico-wb-logo</title>
                <path d="M7.264 10.8l-2.764-0.964c-0.101-0.036-0.172-0.131-0.172-0.243 0-0.053 0.016-0.103 0.044-0.144l-0.001 0.001 6.686-8.55c0.129-0.129 0-0.321-0.129-0.386-0.631-0.163-1.355-0.256-2.102-0.256-2.451 0-4.666 1.009-6.254 2.633l-0.002 0.002c-0.791 0.774-1.439 1.691-1.905 2.708l-0.023 0.057c-0.407 0.95-0.644 2.056-0.644 3.217 0 0.044 0 0.089 0.001 0.133l-0-0.007c0 1.221 0.257 2.314 0.643 3.407 0.872 1.906 2.324 3.42 4.128 4.348l0.051 0.024c0.129 0.064 0.257 0 0.321-0.129l2.25-5.593c0.064-0.129 0-0.257-0.129-0.321z"></path>
                <path d="M16.714 5.914c-0.841-1.851-2.249-3.322-4.001-4.22l-0.049-0.023c-0.040-0.027-0.090-0.043-0.143-0.043-0.112 0-0.206 0.071-0.242 0.17l-0.001 0.002-2.507 5.914c0 0.129 0 0.257 0.129 0.321l2.571 1.286c0.129 0.064 0.129 0.257 0 0.386l-5.979 7.264c-0.129 0.129 0 0.321 0.129 0.386 0.618 0.15 1.327 0.236 2.056 0.236 2.418 0 4.615-0.947 6.24-2.49l-0.004 0.004c0.771-0.771 1.414-1.671 1.929-2.7 0.45-1.029 0.643-2.121 0.643-3.279s-0.193-2.314-0.643-3.279z"></path>
            </symbol>
            <symbol id="sico-more" viewBox="0 0 16 16">
                <path d="M6 0H1C.4 0 0 .4 0 1v5c0 .6.4 1 1 1h5c.6 0 1-.4 1-1V1c0-.6-.4-1-1-1M15 0h-5c-.6 0-1 .4-1 1v5c0 .6.4 1 1 1h5c.6 0 1-.4 1-1V1c0-.6-.4-1-1-1M6 9H1c-.6 0-1 .4-1 1v5c0 .6.4 1 1 1h5c.6 0 1-.4 1-1v-5c0-.6-.4-1-1-1M15 9h-5c-.6 0-1 .4-1 1v5c0 .6.4 1 1 1h5c.6 0 1-.4 1-1v-5c0-.6-.4-1-1-1"/>
            </symbol>
            <symbol id="sico-plugins" viewBox="0 0 16 16">
                <path fill-rule="evenodd" d="M16 3h-2V0h-2v3H8V0H6v3H4v2h1v2a5 5 0 0 0 4 4.9V14H2v-4H0v5c0 .6.4 1 1 1h9c.6 0 1-.4 1-1v-3.1A5 5 0 0 0 15 7V5h1V3z"/>
            </symbol>
            <symbol id="sico-doc" viewBox="0 0 16 16">
                <path fill-rule="evenodd" d="M15 0H1C.4 0 0 .4 0 1v14c0 .6.4 1 1 1h14c.6 0 1-.4 1-1V1c0-.6-.4-1-1-1zm-1 2v9h-3c-.6 0-1 .4-1 1v1H6v-1c0-.6-.4-1-1-1H2V2h12z"/><path d="M4 4h8v2H4zM4 7h8v2H4z"/>
            </symbol>
            <symbol id="wbsico-hk" viewBox="0 0 512 512">
                <path fill="#ff4b55" d="M503.2 423.7H8.8c-4.8 0-8.8-4-8.8-8.8V97.1c0-4.9 4-8.8 8.8-8.8h494.4c4.8 0 8.8 4 8.8 8.8v317.8c0 4.9-4 8.8-8.8 8.8z"/><g fill="#f5f5f5"><path d="M224.5 269a44.5 44.5 0 01-34.6-15.6 2 2 0 01.2-2.9 2 2 0 012.8.2c16.7 18.4 37.4 15.2 49.7 10.7-4.5.2-10.3-.1-14-2.5-15.4-10.2-8.4-21-18.6-34-10.2-13-19.3-12.6-33.8-10.4-14.2 2.1-18.8-8.3-20.2-14.1-.2-1-1.7-1.1-2-.1-17.9 48 35.6 107.5 90.5 64.7-5.4 2-12.4 3.8-20 4zm-40-16.4a1 1 0 01-1.9 0l-2-6.8-7-.2a1 1 0 01-.6-1.8l5.8-4-2-6.8a1 1 0 011.5-1l5.7 4.3 5.8-4a1 1 0 011.4 1.1l-2.3 6.7 5.6 4.3a1 1 0 01-.6 1.7l-7-.1-2.5 6.6zM263.9 237c8.8-6.8 21-11.4 37-8.3a2 2 0 011.5 2.4 2 2 0 01-2.4 1.5c-24.3-4.6-39 10.3-46.2 21.3 3.6-3 8.4-6 12.8-6.4 18.4-1 19.2 11.7 35.3 16 15.9 4.3 23-1.5 33.2-11.9 10.1-10.3 20-4.6 24.7-.8.8.7 2-.1 1.7-1.2-14.6-49-93-64.6-111.3 2.5a60.4 60.4 0 0113.7-15.1zm41.8-11a1 1 0 011.5-1l5.7 4.1 5.8-4a1 1 0 011.4 1l-2.2 6.8 5.6 4.3a1 1 0 01-.6 1.7h-7l-2.3 6.6a1 1 0 01-1.8 0l-2.2-6.7-7-.2a1 1 0 01-.6-1.7l5.8-4.1-2-6.8z"/><path d="M234.4 241.6a44.5 44.5 0 011.2-37.8 2 2 0 012.7-1 2 2 0 01.9 2.7c-10.6 22.4.2 40.3 9 50-1.9-4-3.8-9.5-3-13.8 3.6-18.1 16.2-15.8 24.4-30.2 8-14.4 4.3-22.7-3.2-35.2-7.4-12.4.5-20.6 5.4-24 .8-.7.3-2-.7-2-51.3 1.8-85.9 73.9-25.5 108.4-3.9-4.3-8.2-10-11.2-17zm-.2-43.2a1 1 0 01-.6-1.7l5.5-4.5-2.5-6.6a1 1 0 011.4-1.1l6 3.8 5.5-4.4a1 1 0 011.5 1l-1.8 6.8 5.9 4a1 1 0 01-.5 1.7l-7 .4-2 6.8a1 1 0 01-1.8 0l-2.5-6.5-7 .3zM274.3 264.9a44.5 44.5 0 0119.5 32.5 2 2 0 01-1.8 2.2 2 2 0 01-2.2-1.8c-3.2-24.5-22-33.7-34.7-37.2 3.9 2.5 8.4 6 10 10.1 6.9 17.2-5 22-4 38.6.9 16.4 8.6 21.4 21.7 27.8 13 6.4 10.7 17.6 8.5 23.2-.4 1 .8 1.8 1.7 1.2 42-29.2 32-108.6-37.4-104.9 5.6 1.5 12.4 4 18.7 8.3zm23.6 36.3a1 1 0 011.4 1l-2.2 6.7 5.7 4.3a1 1 0 01-.6 1.7h-7l-2.3 6.7a1 1 0 01-1.8 0l-2.2-6.8h-7a1 1 0 01-.6-1.8l5.7-4.1-2-6.8a1 1 0 011.4-1l5.7 4.1 5.8-4z"/><path d="M251.3 284.8a44.5 44.5 0 01-25 28.5 2 2 0 01-2.7-1 2 2 0 011-2.7c22.5-10.5 25.5-31.2 24.9-44.3-1.2 4.4-3.2 9.8-6.6 12.6-14.2 11.7-22.5 1.9-38 7.8-15.3 6-17.7 14.8-19.8 29.2-2.2 14.3-13.5 15.5-19.5 15.2-1-.1-1.6 1.3-.7 2 40.7 31 113.3-2.5 88.6-67.6.3 5.8 0 13-2.2 20.3zm-27.4 33.5a1 1 0 01-.6 1.7h-7l-2.3 6.7a1 1 0 01-1.8 0l-2.2-6.8-7-.1a1 1 0 01-.6-1.8l5.7-4-2-6.8a1 1 0 011.5-1l5.7 4.1 5.7-4a1 1 0 011.5 1l-2.2 6.8 5.6 4.2z"/></g>
            </symbol>
            <symbol id="wbsico-jp" viewBox="0 0 512 512">
                <path fill="#f5f5f5" d="M503.2 423.7H8.8c-4.8 0-8.8-4-8.8-8.8V97.1c0-4.9 4-8.8 8.8-8.8h494.4c4.8 0 8.8 4 8.8 8.8v317.8c0 4.9-4 8.8-8.8 8.8z"/><circle cx="256" cy="256" r="97.1" fill="#ff4b55"/>
            </symbol>
            <symbol id="wbsico-us" viewBox="0 0 512 512">
                <path fill="#f5f5f5" d="M503.2 423.7H8.8c-4.8 0-8.8-4-8.8-8.8V97.1c0-4.9 4-8.8 8.8-8.8h494.4c4.8 0 8.8 4 8.8 8.8v317.8c0 4.9-4 8.8-8.8 8.8z"/><path fill="#ff4b55" d="M512 114H0V97.2c0-4.9 4-8.8 8.8-8.8h494.4c4.8 0 8.8 4 8.8 8.8v17zM0 191.5h512v25.8H0zm0-51.6h512v25.8H0zm512 129H8.8c-4.8 0-8.8-4-8.8-8.8v-17h512v25.8zM0 346.3h512v25.8H0zm503.2 77.4H8.8c-4.8 0-8.8-4-8.8-8.8v-17h512v17c0 4.9-4 8.8-8.8 8.8zM0 294.7h512v25.8H0z"/><path fill="#41479b" d="M229.5 88.3H8.8C4 88.3 0 92.3 0 97v163c0 4.8 4 8.8 8.8 8.8h220.7c4.9 0 8.8-4 8.8-8.8V97c0-4.9-4-8.8-8.8-8.8z"/><path fill="#f5f5f5" d="M24.8 108.5l2 5.9h6.1c.8 0 1.2 1 .5 1.5l-5 3.7 1.9 6a.8.8 0 01-1.3.8l-5-3.6-5 3.6a.8.8 0 01-1.3-.9l1.9-5.9-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.9h6.1c.8 0 1.2 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.9-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.6l2 6h6.1c.8 0 1.2 1 .5 1.5l-5 3.6 1.9 6a.8.8 0 01-1.3.8l-5-3.5-5 3.5a.8.8 0 01-1.3-.9l1.9-5.9-5-3.6a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.7l2 5.9h6.1c.8 0 1.2 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.9-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.8h6.1c.8 0 1.2 1 .5 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.9-5.9-5-3.6a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm23.8-107.6l2 5.8h6.1c.8 0 1.1 1.1.5 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.9-5.9-5-3.6a.8.8 0 01.5-1.5H45l2-6a.8.8 0 011.6 0zm0 30.6l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-1l1.9-5.8-5-3.7a.8.8 0 01.5-1.5H45l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.8h6.1c.8 0 1.1 1.1.5 1.6l-5 3.7 1.9 5.8a.8.8 0 01-1.3 1l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.9-5.8-5-3.7a.8.8 0 01.5-1.5H45l2-6a.8.8 0 011.6 0zm0 30.6l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-.9l1.9-5.9-5-3.7a.8.8 0 01.5-1.5H45l2-5.9a.8.8 0 011.6 0zm23.8-107l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 6a.8.8 0 01-1.3.8l-5-3.6-5 3.6a.8.8 0 01-1.3-.9l1.8-5.9-5-3.7a.8.8 0 01.6-1.5h6.1l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm0 30.6l2 6h6.1c.8 0 1.1 1 .5 1.5l-5 3.6 1.9 6a.8.8 0 01-1.3.8l-5-3.5-5 3.5a.8.8 0 01-1.3-.9L67 181l-5-3.6a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm0 30.7l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.6-1.5h6.1l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.8h6.1c.8 0 1.1 1 .5 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.9-5-3.6a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm23.8-107.6l2 5.8h6.1c.8 0 1.1 1.1.5 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.9-5-3.6a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm0 30.6l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.6-1.5h6.1l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.8h6.1c.8 0 1.1 1.1.5 1.6l-5 3.7 1.9 5.8a.8.8 0 01-1.3 1l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm0 30.6l2 5.9h6.1c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-.9l1.8-5.9-5-3.7a.8.8 0 01.6-1.5h6.1l2-5.9a.8.8 0 011.6 0zm23.8-107l2 5.9h6c.9 0 1.2 1 .6 1.5l-5 3.7 1.9 6a.8.8 0 01-1.3.8l-5-3.6-5 3.6a.8.8 0 01-1.3-.9l1.8-5.9-5-3.7a.8.8 0 01.6-1.5h6.1l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.9h6c.9 0 1.2 1 .6 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm0 30.6l2 6h6c.9 0 1.2 1 .6 1.5l-5 3.6 1.9 6a.8.8 0 01-1.3.8l-5-3.5-5 3.5a.8.8 0 01-1.3-.9l1.8-5.9-5-3.6a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm0 30.7l2 5.9h6c.9 0 1.2 1 .6 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.6-1.5h6.1l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.8h6c.9 0 1.2 1 .6 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.9-5-3.6a.8.8 0 01.6-1.5h6.1l2-6a.8.8 0 011.6 0zm23.8-107.6l2 5.8h6c.9 0 1.2 1.1.6 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.9-5-3.6a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.6 0zm0 30.6l2 5.9h6c.9 0 1.2 1 .6 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.6 0zm0 30.7l2 5.8h6c.9 0 1.2 1.1.6 1.6l-5 3.7 1.9 5.8a.8.8 0 01-1.3 1l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.6 0zm0 30.6l2 5.9h6c.9 0 1.2 1 .6 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-.9l1.8-5.9-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.6 0zm23.7-107l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 6a.8.8 0 01-1.3.8l-5-3.6-5 3.6a.8.8 0 01-1.3-.9l1.8-5.9-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.6l2 6h6.2c.8 0 1.1 1 .5 1.5l-5 3.6 1.9 6a.8.8 0 01-1.3.8l-5-3.5-5 3.5a.8.8 0 01-1.3-.9l1.8-5.9-5-3.6a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.7l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.8h6.2c.8 0 1.1 1 .5 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.9-5-3.6a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm23.8-107.6l2 5.8h6.2c.8 0 1.1 1.1.5 1.6l-5 3.6 1.9 6a.8.8 0 01-1.3.9l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.9-5-3.6a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.6l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.8h6.2c.8 0 1.1 1.1.5 1.6l-5 3.7 1.9 5.8a.8.8 0 01-1.3 1l-5-3.6-5 3.6a.8.8 0 01-1.3-1l1.8-5.8-5-3.7a.8.8 0 01.5-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.6l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.9 5.9a.8.8 0 01-1.3 1l-5-3.7-5 3.6a.8.8 0 01-1.3-.9l1.8-5.9-5-3.7a.8.8 0 01.5-1.5h6.2l2-5.9a.8.8 0 011.5 0zm23.8-107l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.8 6a.8.8 0 01-1.2.8l-5-3.6-5 3.6a.8.8 0 01-1.4-.9l2-5.9-5-3.7a.8.8 0 01.4-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.8 5.9a.8.8 0 01-1.2.9l-5-3.6-5 3.6a.8.8 0 01-1.4-1l2-5.8-5-3.7a.8.8 0 01.4-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.6l2 6h6.2c.8 0 1.1 1 .5 1.5l-5 3.6 1.8 6a.8.8 0 01-1.2.8l-5-3.5-5 3.5a.8.8 0 01-1.4-.9l2-5.9-5-3.6a.8.8 0 01.4-1.5h6.2l2-6a.8.8 0 011.5 0zm0 30.7l2 5.9h6.2c.8 0 1.1 1 .5 1.5l-5 3.7 1.8 5.9a.8.8 0 01-1.2.9l-5-3.6-5 3.6a.8.8 0 01-1.4-1l2-5.8-5-3.7a.8.8 0 01.4-1.5h6.2l2-5.9a.8.8 0 011.5 0zm0 30.7l2 5.8h6.2c.8 0 1.1 1 .5 1.6l-5 3.6 1.8 6a.8.8 0 01-1.2.9l-5-3.6-5 3.6a.8.8 0 01-1.4-1l2-5.9-5-3.6a.8.8 0 01.4-1.5h6.2l2-6a.8.8 0 011.5 0z"/>
            </symbol>
        </defs>
    </svg>
</div>




<div id="optionsframework-wrap" class="wbs-wrap wbps-wrap" data-wba-source="<?php echo $pd_code; ?>">
    <div class="wbs-header" id="wb_skt_panel">
        <svg class="wb-icon sico-wb-logo"><use xlink:href="#sico-wb-logo"></use></svg>
        <span>WBOLT</span>
        <strong><?php echo $pd_title; ?></strong>

        <div class="links">
            <a class="wb-btn" href="<?php echo $pd_index_url; ?>" data-wba-campaign="title-bar" target="_blank">
                <svg class="wb-icon sico-plugins"><use xlink:href="#sico-plugins"></use></svg>
                <span>插件主页</span>
            </a>
            <a class="wb-btn" href="<?php echo $pd_doc_url; ?>" data-wba-campaign="title-bar" target="_blank">
                <svg class="wb-icon sico-doc"><use xlink:href="#sico-doc"></use></svg>
                <span>说明文档</span>
            </a>
        </div>
    </div>

    <div class="wbs-main">
        <form class="wbs-content option-form" id="optionsframework" action="options.php" method="post">
		    <?php
		    settings_fields($setting_field);
		    ?>


            <div class="sc-body pt-l" id="J_SKTsetting">
                <table class="wbs-form-table">
                    <tbody>
                    <tr>
                        <th class="row w8em">是否启用插件</th>
                        <td>
                            <input class="wb-switch" type="checkbox" name="<?php echo $setting_field;?>[switch]" value="1" <?php echo isset($opt['switch']) && $opt['switch'] ? 'checked="checked"':''; ?>>
                        </td>
                    </tr>
                    <tr>
                        <th class="row">选择服务器节点</th>
                        <td>
                            <div class="selector-bar">
                                <label><input class="wbs-radio" type="radio" name="<?php echo $setting_field;?>[type]" value="jp" <?php echo $opt['type']=='jp' ? 'checked' : ''; ?>> <svg class="wb-icon wbsico-flag"><use xlink:href="#wbsico-jp"></use></svg><span>日本服务器节点（推荐）</span></label>
                                <label><input class="wbs-radio" type="radio" name="<?php echo $setting_field;?>[type]" value="hk" <?php echo $opt['type']=='hk' ? 'checked' : ''; ?>> <svg class="wb-icon wbsico-flag"><use xlink:href="#wbsico-hk"></use></svg><span>香港服务器节点</span></label>
                                <label><input class="wbs-radio" type="radio" name="<?php echo $setting_field;?>[type]" value="us" <?php echo $opt['type']=='us' ? 'checked' : ''; ?>> <svg class="wb-icon wbsico-flag"><use xlink:href="#wbsico-us"></use></svg><span>美国服务器节点</span></label>
                                <label><input class="wbs-radio" type="radio" name="<?php echo $setting_field;?>[type]" value="other" <?php echo $opt['type']=='other' ? 'checked' : ''; ?>> <span>自定义服务器节点</span>
                                    <div><input class="wbs-input" data-max="80" name="<?php echo $setting_field;?>[proxy]" type="text" value="<?php echo $opt['proxy'];?>" placeholder="输入代理IP端口格式：192.192.192.19:1080"></div></label>
                            </div>

                        </td>
                    </tr>
                    </tbody>
                </table>
                <div class="description">
                    温馨提示：Kill 429插件采用的是“CDN+Nginx反向代理”的方式，来帮助国内站长解决更新或者安装WordPress最新版本、Wordpress市场主题插件时遭遇"429 too many requests"的问题。
                </div>
            </div>


            <?php echo $api_html;  ?>
            <div class="wb-copyright-bar">
                <div class="wbcb-inner">
                    <a class="wb-logo" href="https://www.wbolt.com" data-wba-campaign="footer" title="WBOLT" target="_blank"><svg class="wb-icon sico-wb-logo"><use xlink:href="#sico-wb-logo"></use></svg></a>
                    <div class="wb-desc">
                        Made By <a href="https://www.wbolt.com" data-wba-campaign="footer" target="_blank">闪电博</a>
                        <span class="wb-version">版本：<?php echo $pd_version;?></span>
                    </div>
                    <div class="ft-links">
                        <a href="https://www.wbolt.com/plugins" data-wba-campaign="footer" target="_blank">免费插件</a>
                        <a href="https://www.wbolt.com/knowledgebase" data-wba-campaign="footer" target="_blank">插件支持</a>
                        <a href="<?php echo $pd_doc_url; ?>" data-wba-campaign="footer" target="_blank">说明文档</a>
                        <a href="https://www.wbolt.com/terms-conditions" data-wba-campaign="footer" target="_blank">服务协议</a>
                        <a href="https://www.wbolt.com/privacy-policy" data-wba-campaign="footer" target="_blank">隐私条例</a>
                    </div>
                </div>
            </div>

            <div class="wbs-footer" id="optionsframework-submit">
                <div class="wbsf-inner">
                    <button class="wbs-btn-primary" type="submit" name="update">保存设置</button>
                </div>
            </div>

        </form>
    </div>
</div>

<script>
    jQuery(document).ready(function($) {
        var _source = $('[data-wba-source]').length && $('[data-wba-source]').data('wba-source') || window.wbaSource || document.domain;
        $('a[data-wba-campaign]').each(function () {
            var me = $(this),
                _campaign = me.data('wba-campaign'),
                _media = me.data('wba-media') || 'link',
                _url = me.attr('href');

            _url += _url.match("[\?]") ? '&' : '?';
            _url += 'utm_source=' + _source;
            _url += '&utm_media=' + _media;
            _url += '&utm_campaign=' + _campaign;

            me.attr('href',_url);
        });
    });

</script>